package com.zheng.operator;

public class Demo06 {
    public static void main(String[] args) {
        /*
        A = 1001 0110
        B = 0000 1101
        ---------------------------
        A&B = 0000 0100
        A|B = 1001 1111
        A^B = 1001 1011 (异或）两相同为0，不同为1
        ~B = 1111 0010（取反）

        面试题：怎么最快的算2*8=16？ 2*2*2*2
        <<   *2
        >>   /2
        效率极高！！！

        0000 0000 0
        0000 0001 1
        0000 0010 2
        0000 0011 3 0001 100
        0000 0100 4
        0000 0101 5
        ...
        0000 1000 8
        0001 0000 16

        2<<3 (0000 0010 2 向左移动三位 → 0001 0000 16）
         */
        System.out.println(3 << 3); // 0000 0011 (3)  → 0001 1000（24）
    }
}
